gen_datasets/generate_data_3d/flow_over_array_of_cylinders/isothermal/k_epsilon/sim_orig/system/extrudeMeshDict_front
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}

constructFrom mesh;
sourceCase ".";
sourcePatches    (front);
extrudeType      patchNormal;
exposedPatchName front;
direction (0 -1 0);

flipNormals false;

extrudeModel linearDirection;

expansionRatio 1;
firstLayerThickness 0.005;
nLayers 10;

linearDirectionCoeffs
{
    direction (0 -1 0);
    thickness 0.15;
}

mergeFaces false;
mergeTol 0;
